In [1]:
import pandas as pd
data = pd.read_csv('https://raw.githubusercontent.com/wongcyu/GroupProject/master/GlobalChangedName.csv')

In [2]:
data.head()

,City,Country,Latitude,Longitude,Year,Value,Date,Time,Min,TimeNew,VAL_0
0,Tokyo,Japan,35.6895,139.69171,1975,23000000,/01/01,01/01/1975,00:00:00,01/01/1975 00:00,1.000000
1,Tokyo,Japan,35.6895,139.69171,1970,20450000,/01/01,01/01/1970,00:00:00,01/01/1970 00:00,0.889130
2,Philadelphia,United States of America,39.95,-75.1667,1914,17600000,/01/01,01/01/1914,00:00:00,01/01/1914 00:00,0.765216
3,New York,United States of America,40.714353,-74.005972,1970,17252000,/01/01,01/01/1970,00:00:00,01/01/1970 00:00,0.750086
4,New York,United States of America,40.714353,-74.005972,1975,17100000,/01/01,01/01/1975,00:00:00,01/01/1975 00:00,0.743477

In [3]:
len(data.groupby('Country'))

139

In [7]:
Europe = ['Russia Federation','Germany','Spain','Ukraine','Belgium','France', 'Italy', 'Netherlands', 'Norway', 'Sweden','Czech Republic', 'Finland',
      'Denmark',  'Switzerland', 'United Kingdoms', 'Poland', 'Greece','Austria','Slovakia', 'Montenegro','Malta','Andorra','Monaco','Liechtenstein'
      'Bulgaria', 'Hungary', 'Luxembourg', 'Romania' , 'Slovakia', 'Estonia', 'Slovenia','Portugal', 'Republic of Moldova','Bosnia and Herzegovina'
      'Croatia', 'Lithuania', 'Latvia','Serbia', 'Estonia', 'Iceland','North Macedonia', 'San Marino','Holy See','Albania','Crimea',
      'Cyprus','Wales']

Asia = ['Afghanistan', 'Bahrain', 'Armenia', 'Azerbaijan', 'Bangladesh', 'Bhutan', 'Brunei', 'Burma', 'Cambodia', 'China', 
        'East Timor', 'Georgia', 'India', 'Indonesia', 'Iran', 'Iraq', 'Israel', 'Japan', 'Jordan', 'Kazakhstan', 'Kuwait',
        'Kyrgyzstan', 'Laos, Lebanon', 'Malaysia', 'Mongolia', 'Nepal', 'North Korea', 'Oman', 'Pakistan', 'Papua New Guinea',
        'Philippines', 'Qatar', 'Saudi Arabia', 'Singapore', 'Republic of Korea', 'Sri Lanka', 'Syria', 'Tajikistan', 'Thailand',
        'Turkey', 'Turkmenistan', 'United Arab Emirates', 'Uzbekistan', 'Vietnam','Yemen','Aazerbaijian','Belarus',
        'Myanmar','Syria/Turkey','Taiwan']

Africa = ['Nigeria','Ethiopia','Egypt','DR Congo','Tanzania','South Africa','Kenya','Uganda','Algeria','Sudan','Morocco', 'Angola','Mozambique','Ghana','Madagascar',
          'Cameroon','Niger','Burkina Faso','Malawi','Mali','Zambia','Zimbabwe','Senegal','Chad','Somalia','Guniea','South Sudan','Rwanda','Benin', 
          'Tunisia','Burundi','Togo','Sierra Leone','Libya','Congo','Eritrea','Liberia',
          'Central African Republic', 'Mauritania','Namibia','Botswana','Lesotho', 'Gambia'
          'Gabon','Guinea-Bissau','Swaziland','Equatorial Guinea','Mauritius','Djibouti',
          'Kenya','Comoros','Cabo Verde','Sao Tome & Principe','Seychelles','Algiers','Cote D lovire',
          'Muritius', ]

Americas = ['United States of America', 'Mexico','Canada','Brazil','Colombia','Argentina','Peru','Venezuela','Chile'
           'Ecuador','Guatemala','Cuba','Bolivia','Haiti','Fominican Repablic','Honduras','Paraguay','Nicaragua',
           'El Salvador','Costa Rica','Panama','Uraguay','Jamaica','Trinidad and Tobago','Guyana',
           'Suriname','Bahamas','Belize','Barbados','Saint Lucia','Grenada','Dominica','Antigua and Barbuda','Columbia',
           'Puerto Rico']

Oceania = ['Austrialia', 'New Zealand']

In [8]:
data['Contient'] = 0
data.loc[data.Country.isin(Asia), 'Contient'] = 'Asia'
data.loc[data.Country.isin(Europe), 'Contient'] = 'Europe'
data.loc[data.Country.isin(Africa), 'Contient'] = 'Africa'
data.loc[data.Country.isin(Americas), 'Contient'] = 'Americas'
data.loc[data.Country.isin(Oceania), 'Contient'] = 'Oceania'

In [9]:
data.head()

,City,Country,Latitude,Longitude,Year,Value,Date,Time,Min,TimeNew,VAL_0,Contient
0,Tokyo,Japan,35.6895,139.69171,1975,23000000,/01/01,01/01/1975,00:00:00,01/01/1975 00:00,1.000000,Asia
1,Tokyo,Japan,35.6895,139.69171,1970,20450000,/01/01,01/01/1970,00:00:00,01/01/1970 00:00,0.889130,Asia
2,Philadelphia,United States of America,39.95,-75.1667,1914,17600000,/01/01,01/01/1914,00:00:00,01/01/1914 00:00,0.765216,Americas
3,New York,United States of America,40.714353,-74.005972,1970,17252000,/01/01,01/01/1970,00:00:00,01/01/1970 00:00,0.750086,Americas
4,New York,United States of America,40.714353,-74.005972,1975,17100000,/01/01,01/01/1975,00:00:00,01/01/1975 00:00,0.743477,Americas

In [10]:
data.to_csv("data_edition.csv")